CONSUMER_RISK = """
ریسک مصرف‌کننده یا خطای نوع اول (α): احتمال پذیرفته شدن نرم‌افزاری است که نرخ خرابی واقعی (λ) آن بیشتر از نرخ خرابی نامطلوب (λ₁) باشد. خطای نوع اول معمولاً بین ۱٪ یا ۱۰٪ بوده و بیانگر سطح معناداری یک آزمون است.
"""

PRODUCER_RISK = """
ریسک تولیدکننده یا خطای نوع دوم (β): احتمال رد شدن نرم‌افزاری است که نرخ خرابی واقعی (λ) آن کمتر یا مساوی نرخ خرابی مطلوب (λ₀) باشد. رایج‌ترین مقدار برای خطای نوع دوم عددی بین ۱۰٪ تا ۲۰٪ است.
"""

MTBF = """
MTBF یا میانگین زمان بین خرابی‌ها، بیانگر میانگین فاصله زمانی بین دو خرابی متوالی در سیستم است.
MTBF =Total Operational Time / Number of Failures 
"""

GOEL_OKUMOTO = """
مدل رشد قابلیت اطمینان نرم‌افزار Goel–Okumoto یک مدل ساده و پرکاربرد است. این مدل بر پایه‌ی فرآیند پواسون ناهمگن تعریف شده است. فرآیند پواسون ناهمگن یک تعمیم از فرآیند پواسون همگن است که در آن نرخ وقوع رویدادها (مانند خرابی‌های نرم‌افزار) با زمان تغییر می‌کند.
"""

WEIBULL = """
مدل Weibull، که به آن مدل تعمیم‌یافته فرآیند نقطه‌ای پواسون غیرهمگن Goel نیز گفته می‌شود، می‌تواند بدون توجه به روند نرخ خرابی مورد استفاده قرار گیرد.
"""

LOG_LOGISTICS = """
مدل Log-Logistics برای مدلسازی روندهای خرابی که بسیاری از مدل‌ها به خوبی آنها را مدیریت نمی‌کنند، توسعه داده شده است. به عنوان مثال، این مدل می‌تواند زمانی استفاده شود که نرخ خرابی به صورت غیرخطی در حال کاهش است.
"""

DUANE = """
منحنی رشد قابلیت اطمینان Duane از زمان شروع مدل‌سازی رشد قابلیت اطمینان، برای قابلیت اطمینان سخت‌افزار مورد استفاده قرار گرفته است. این مدل همچنین برای قابلیت اطمینان نرم‌افزار، معمولاً زمانی که نرخ خرابی به صورت خطی در حال کاهش است، استفاده می‌شود.
"""

FAILURE_RATE_CHANGE = """
نمودار تغییرات نرخ خرابی: برای رسم این نمودار نرخ خرابی را روی محور افقی و نمودار تعداد تجمعی خرابی‌های مشاهده شده را روی محور عمودی نمایش داده می‌شوند.
"""

FAILURE_DETECTION_RATE = """
نمودار نرخ کشف خرابی: برای رسم این نمودار تعداد خرابی‌های غیر تجمعی را روی محور عمودی و فواصل آزمون را روی محور افقی نمایش داده می‌شوند.
"""